package problem_solving_java.level01;

//풀이시간    : 2021-11-13 21:10 ~ 21:19
//결과	  	  : 100.0 / 100.0 (정확성: 100.0)
//나의 판단   : 잘 풀었음 !!!

/*
* <문제 제목> : 약수의 개수와 덧셈


* <문제> : 
	→ 두 정수 left와 right가 매개변수로 주어집니다.
	  left부터 right까지의 모든 수들 중에서,
	  약수의 개수가 짝수인 수는 더하고,
	  약수의 개수가 홀수인 수는 뺀 수를 return 하도록 solution 함수를 완성해주세요.

class Solution {
    public int solution(int left, int right) {
        int answer = 0;
        return answer;
    }
}
	
	
* <제한사항> :
	★ 1 ≤ left ≤ right ≤ 1,000
	
	
* <입.출력 예시>
	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
	left		right		result
	13			17			43
	24			27			52
	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
	
	★ 입출력 예 #1
		→ 다음 표는 13부터 17까지의 수들의 약수를 모두 나타낸 것입니다.
		ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
		수			약수				약수의 개수
		13			1, 13				2
		14			1, 2, 7, 14			4
		15			1, 3, 5, 15			4
		16			1, 2, 4, 8, 16		5
		17			1, 17				2
		ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
		→ 따라서, 13 + 14 + 15 - 16 + 17 = 43을 return 해야 합니다.
		  
		
	★ 입출력 예 #2

		→ 다음 표는 24부터 27까지의 수들의 약수를 모두 나타낸 것입니다.
		ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
		수			약수							약수의 개수
		24			1, 2, 3, 4, 6, 8, 12, 24		8
		25			1, 5, 25						3
		26			1, 2, 13, 26					4
		27			1, 3, 9, 27						4
		ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
		  
		→ 따라서, 24 - 25 + 26 + 27 = 52를 return 해야 합니다.

*/

public class Problem_016_MySolution01 {

	public int solution(int left, int right) {
		
        int answer = 0;
        int tempCnt = 0;
        
        while (left <= right) {
        	tempCnt = 0;
        	
        	for (int j=1; j<=left; j++) {
        		if (left % j == 0) {
        			tempCnt++;
        		}
        	}
        	
        	if (tempCnt % 2 == 0) {	//	짝수
        		answer += left;
        	} else {
        		answer -= left;		//	홀수
        	}
        	
        	left++; 	
        }
        
        return answer;
        
    }
	
}
